app/controllers/meetings_controller.rb

SELECT "courses".* FROM "courses"
---
  def new
   @courses = Course.all

INSERT INTO "meetings" ("course_id", "held_on") VALUES (?, ?)  [["course_id", 2], ["held_on", Tue, 01 Jan 2013]]
---
  def create
    @meeting = Meeting.new
    @meeting.held_on = params[:held_on]
    @meeting.course_id = params[:course_id]

    if @meeting.save